echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l151f3.h
/* DMA1 memory 0 address low register (channel 2) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A0        : 1;
  unsigned char M0A1        : 1;
  unsigned char M0A2        : 1;
  unsigned char M0A3        : 1;
  unsigned char M0A4        : 1;
  unsigned char M0A5        : 1;
  unsigned char M0A6        : 1;
  unsigned char M0A7        : 1;
} __BITS_DMA1_C2M0ARL;
#endif
__IO_REG8_BIT(DMA1_C2M0ARL, 0x5090, __READ_WRITE, __BITS_DMA1_C2M0ARL);

/* DMA1 channel 3 configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char TCIE        : 1;
  unsigned char HTIE        : 1;
  unsigned char DIR         : 1;
  unsigned char CIRC        : 1;
  unsigned char MINCDEC     : 1;
  unsigned char MEM         : 1;
} __BITS_DMA1_C3CR;
#endif
__IO_REG8_BIT(DMA1_C3CR,   0x5093, __READ_WRITE, __BITS_DMA1_C3CR);

/* DMA1 channel 3 status */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TCIF        : 1;
  unsigned char HTIF        : 1;
  unsigned char TSIZE       : 1;
  unsigned char PL0         : 1;
  unsigned char PL1         : 1;
  unsigned char PEND        : 1;
  unsigned char BUSY        : 1;
} __BITS_DMA1_C3SPR;
#endif
__IO_REG8_BIT(DMA1_C3SPR,  0x5094, __READ_WRITE, __BITS_DMA1_C3SPR);

/* DMA1 number of data to transfer register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NDT0        : 1;
  unsigned char NDT1        : 1;
  unsigned char NDT2        : 1;
  unsigned char NDT3        : 1;
  unsigned char NDT4        : 1;
  unsigned char NDT5        : 1;
  unsigned char NDT6        : 1;
  unsigned char NDT7        : 1;
} __BITS_DMA1_C3NDTR;
#endif
__IO_REG8_BIT(DMA1_C3NDTR, 0x5095, __READ_WRITE, __BITS_DMA1_C3NDTR);

/* DMA1 peripheral address high register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char PA8         : 1;
    unsigned char PA9         : 1;
    unsigned char PA10        : 1;
    unsigned char PA11        : 1;
    unsigned char PA12        : 1;
    unsigned char PA13        : 1;
    unsigned char PA14        : 1;
    unsigned char PA15        : 1;
  } mem_clr;
  struct
  {
    unsigned char M1A8        : 1;
    unsigned char M1A9        : 1;
    unsigned char M1A10       : 1;
    unsigned char M1A11       : 1;
    unsigned char M1A12       : 1;
    unsigned char M1A13       : 1;
    unsigned char M1A14       : 1;
    unsigned char M1A15       : 1;
  } mem_set;
} __BITS_DMA1_C3PARH_C3M1ARH;
#endif
__IO_REG8_BIT(DMA1_C3PARH_C3M1ARH, 0x5096, __READ_WRITE, __BITS_DMA1_C3PARH_C3M1ARH);

/* Register aliases for DMA1_C3PARH_C3M1ARH */
#define DMA1_C3PARH      DMA1_C3PARH_C3M1ARH
#define DMA1_C3PARH_bit  DMA1_C3PARH_C3M1ARH_bit.mem_clr

#define DMA1_C3M1ARH     DMA1_C3PARH_C3M1ARH
#define DMA1_C3M1ARH_bit DMA1_C3PARH_C3M1ARH_bit.mem_set


/* DMA1 peripheral address low register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef union
{
  struct
  {
    unsigned char PA0         : 1;
    unsigned char PA1         : 1;
    unsigned char PA2         : 1;
    unsigned char PA3         : 1;
    unsigned char PA4         : 1;
    unsigned char PA5         : 1;
    unsigned char PA6         : 1;
    unsigned char PA7         : 1;
  } mem_clr;
  struct
  {
    unsigned char M1A0        : 1;
    unsigned char M1A1        : 1;
    unsigned char M1A2        : 1;
    unsigned char M1A3        : 1;
    unsigned char M1A4        : 1;
    unsigned char M1A5        : 1;
    unsigned char M1A6        : 1;
    unsigned char M1A7        : 1;
  } mem_set;
} __BITS_DMA1_C3PARL_C3M1ARL;
#endif
__IO_REG8_BIT(DMA1_C3PARL_C3M1ARL, 0x5097, __READ_WRITE, __BITS_DMA1_C3PARL_C3M1ARL);

/* Register aliases for DMA1_C3PARL_C3M1ARL */
#define DMA1_C3PARL      DMA1_C3PARL_C3M1ARL
#define DMA1_C3PARL_bit  DMA1_C3PARL_C3M1ARL_bit.mem_clr

#define DMA1_C3M1ARL     DMA1_C3PARL_C3M1ARL
#define DMA1_C3M1ARL_bit DMA1_C3PARL_C3M1ARL_bit.mem_set


/* DMA1 memory 0 address high register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A8        : 1;
  unsigned char M0A9        : 1;
  unsigned char M0A10       : 1;
  unsigned char M0A11       : 1;
  unsigned char M0A12       : 1;
  unsigned char M0A13       : 1;
  unsigned char M0A14       : 1;
  unsigned char M0A15       : 1;
} __BITS_DMA1_C3M0ARH;
#endif
__IO_REG8_BIT(DMA1_C3M0ARH, 0x5099, __READ_WRITE, __BITS_DMA1_C3M0ARH);

/* DMA1 memory 0 address low register (channel 3) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A0        : 1;
  unsigned char M0A1        : 1;
  unsigned char M0A2        : 1;
  unsigned char M0A3        : 1;
  unsigned char M0A4        : 1;
  unsigned char M0A5        : 1;
  unsigned char M0A6        : 1;
  unsigned char M0A7        : 1;
} __BITS_DMA1_C3M0ARL;
#endif
__IO_REG8_BIT(DMA1_C3M0ARL, 0x509A, __READ_WRITE, __BITS_DMA1_C3M0ARL);


/*-------------------------------------------------------------------------
 *      DMA1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define DMA1_GCSR_GEN            DMA1_GCSR_bit.GEN
#define DMA1_GCSR_GB             DMA1_GCSR_bit.GB
#define DMA1_GCSR_TO             DMA1_GCSR_bit.TO

#define DMA1_GIR1_IFC0           DMA1_GIR1_bit.IFC0
#define DMA1_GIR1_IFC1           DMA1_GIR1_bit.IFC1
#define DMA1_GIR1_IFC2           DMA1_GIR1_bit.IFC2
#define DMA1_GIR1_IFC3           DMA1_GIR1_bit.IFC3

#define DMA1_C0CR_EN             DMA1_C0CR_bit.EN
#define DMA1_C0CR_TCIE           DMA1_C0CR_bit.TCIE
#define DMA1_C0CR_HTIE           DMA1_C0CR_bit.HTIE
#define DMA1_C0CR_DIR            DMA1_C0CR_bit.DIR
#define DMA1_C0CR_CIRC           DMA1_C0CR_bit.CIRC
#define DMA1_C0CR_MINCDEC        DMA1_C0CR_bit.MINCDEC

#define DMA1_C0SPR_TCIF          DMA1_C0SPR_bit.TCIF
#define DMA1_C0SPR_HTIF          DMA1_C0SPR_bit.HTIF
#define DMA1_C0SPR_TSIZE         DMA1_C0SPR_bit.TSIZE
#define DMA1_C0SPR_PL0           DMA1_C0SPR_bit.PL0
#define DMA1_C0SPR_PL1           DMA1_C0SPR_bit.PL1
#define DMA1_C0SPR_PEND          DMA1_C0SPR_bit.PEND
#define DMA1_C0SPR_BUSY          DMA1_C0SPR_bit.BUSY

#define DMA1_C0NDTR_NDT0         DMA1_C0NDTR_bit.NDT0
#define DMA1_C0NDTR_NDT1         DMA1_C0NDTR_bit.NDT1
#define DMA1_C0NDTR_NDT2         DMA1_C0NDTR_bit.NDT2
#define DMA1_C0NDTR_NDT3         DMA1_C0NDTR_bit.NDT3
#define DMA1_C0NDTR_NDT4         DMA1_C0NDTR_bit.NDT4
#define DMA1_C0NDTR_NDT5         DMA1_C0NDTR_bit.NDT5
#define DMA1_C0NDTR_NDT6         DMA1_C0NDTR_bit.NDT6
#define DMA1_C0NDTR_NDT7         DMA1_C0NDTR_bit.NDT7

#define DMA1_C0PARH_PA8          DMA1_C0PARH_bit.PA8
#define DMA1_C0PARH_PA9          DMA1_C0PARH_bit.PA9
#define DMA1_C0PARH_PA10         DMA1_C0PARH_bit.PA10
#define DMA1_C0PARH_PA11         DMA1_C0PARH_bit.PA11
#define DMA1_C0PARH_PA12         DMA1_C0PARH_bit.PA12
#define DMA1_C0PARH_PA13         DMA1_C0PARH_bit.PA13
#define DMA1_C0PARH_PA14         DMA1_C0PARH_bit.PA14
#define DMA1_C0PARH_PA15         DMA1_C0PARH_bit.PA15

#define DMA1_C0PARL_PA0          DMA1_C0PARL_bit.PA0
#define DMA1_C0PARL_PA1          DMA1_C0PARL_bit.PA1
#define DMA1_C0PARL_PA2          DMA1_C0PARL_bit.PA2
#define DMA1_C0PARL_PA3          DMA1_C0PARL_bit.PA3
#define DMA1_C0PARL_PA4          DMA1_C0PARL_bit.PA4
#define DMA1_C0PARL_PA5          DMA1_C0PARL_bit.PA5
#define DMA1_C0PARL_PA6          DMA1_C0PARL_bit.PA6
#define DMA1_C0PARL_PA7          DMA1_C0PARL_bit.PA7

#define DMA1_C0M0ARH_M0A8        DMA1_C0M0ARH_bit.M0A8
#define DMA1_C0M0ARH_M0A9        DMA1_C0M0ARH_bit.M0A9
#define DMA1_C0M0ARH_M0A10       DMA1_C0M0ARH_bit.M0A10
#define DMA1_C0M0ARH_M0A11       DMA1_C0M0ARH_bit.M0A11
#define DMA1_C0M0ARH_M0A12       DMA1_C0M0ARH_bit.M0A12
#define DMA1_C0M0ARH_M0A13       DMA1_C0M0ARH_bit.M0A13
#define DMA1_C0M0ARH_M0A14       DMA1_C0M0ARH_bit.M0A14
#define DMA1_C0M0ARH_M0A15       DMA1_C0M0ARH_bit.M0A15

